>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "55XMMELJ"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Short form of 55XMMELJ z0049 87 z4295 101 z4335 805 z4349 z4350 z4352 104 z0023 z0025 113 121 z4418 z4419 z4443 z4460
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
2006 Wis. Legis. Serv. 45.
<<===== RESULT =====<<

>>===== INPUT =====>>
[
  {
    "id": "55XMMELJ",
    "type": "legislation",
    "container-title": "Wis. Legis. Serv.",
    "page": "45",
    "publisher": "West",
    "jurisdiction": "us:wi",
    "collection-number": "2006"
  }
]
<<===== INPUT =====<<


>>===== OPTIONS =====>>
{
  "wrap_url_and_doi": true
}
<<===== OPTIONS =====<<


>>===== CITATION-ITEMS =====>>
[
  [
    {
      "id": "55XMMELJ",
      "position": 1,
      "near-note": 1
    }
  ]
]
<<===== CITATION-ITEMS =====<<