>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "3CQIQYEF"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Short form of 3CQIQYEF z0049 z0015 71 z4283 z0016 z0017 77 z4301 267 101 z4353 z4359 104 109 118 121 z4401 z4402 z4409 z4426 z4434 z4460
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
William Jones, No. 1234-567-89, 2006 WL 123654 (Comp. Gen. Apr. 1, 2000).
<<===== RESULT =====<<

>>===== INPUT =====>>
[
  {
    "id": "3CQIQYEF",
    "type": "legal_case",
    "title": "William Jones",
    "container-title": "WL",
    "authority": "Comp. Gen.",
    "number": "1234\\-567\\-89",
    "issued": {
      "date-parts": [
        [
          2000,
          4,
          1
        ]
      ]
    },
    "archive_location": "123654",
    "jurisdiction": "us",
    "collection-number": "2006",
    "admin-flag": "1"
  }
]
<<===== INPUT =====<<


>>===== OPTIONS =====>>
{
  "wrap_url_and_doi": true
}
<<===== OPTIONS =====<<


>>===== CITATION-ITEMS =====>>
[
  [
    {
      "id": "3CQIQYEF",
      "position": 0
    }
  ]
]
<<===== CITATION-ITEMS =====<<