>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "EVDYCCCA"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
<var>year</var> N.M. Adv. Legis. Serv. <var>page no.</var>
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
[
  {
    "id": "EVDYCCCA",
    "position": 0
  }
]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "EVDYCCCA",
    "type": "legislation",
    "title": "N.M. Adv. Legis. Serv.",
    "volume": "2000",
    "section": "45",
    "jurisdiction": "us:nm"
  }
]
<<===== INPUT =====<<