>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== OPTIONS =====>>
{
    "wrap_url_and_doi": true
}
<<===== OPTIONS =====<<

>>===== KEYS =====>>
[
  "UYYXH463"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
2006 Alaska Legis. Serv. 45 (West)
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
  [
    {
      "id": "UYYXH463",
      "position": 0
    }
  ]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "UYYXH463",
    "type": "legislation",
    "container-title": "Alaska Legis. Serv.",
    "page": "45",
    "publisher": "West",
    "jurisdiction": "us:ak",
    "collection-number": "2006"
  }
]
<<===== INPUT =====<<