>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "8BKLM6PA"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
Mass. Gen. Laws ch. <var>x</var>, ยง <var>x</var> (<var>year</var>)
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
[
  {
    "id": "8BKLM6PA",
    "position": 0,
    "locator": "ch. 123, sec. 123"
  }
]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "8BKLM6PA",
    "type": "legislation",
    "container-title": "Mass. Gen. Laws",
    "issued": {
      "date-parts": [
        [
          2000
        ]
      ]
    },
    "section": "ch. 123, ยง 123",
    "jurisdiction": "us:ma"
  }
]
<<===== INPUT =====<<