>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "RLZS8FZU"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
<var>year</var> Haw. Sess. Laws <var>page no.</var>
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
[
  {
    "id": "RLZS8FZU",
    "position": 0
  }
]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "RLZS8FZU",
    "type": "legislation",
    "title": "Haw. Sess. Laws",
    "volume": "2000",
    "section": "45",
    "jurisdiction": "us:hi"
  }
]
<<===== INPUT =====<<