>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "CIL796UN"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
should pass test style_test001
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
<i>see also</i> Gerald Lebovits, <i>Write the Cites Right—Part II</i>, 76 N.Y. St. B.J. 64 (Dec. 2004)
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
  [
    {
      "id": "CIL796UN",
      "prefix": "<i>see also</i>"
    }
  ]
]
<<===== CITATION-ITEMS =====<<


>>===== INPUT =====>>
[
  {
    "id": "CIL796UN",
    "type": "article-journal",
    "title": "Write the Cites Right—Part II",
    "author": [
      {
        "given": "Gerald",
        "family": "Lebovits"
      }
    ],
    "container-title": "N.Y. St. B.J.",
    "volume": "76",
    "page": "64",
    "issued": {
      "raw": "2004-12"
    },
    "multi": {
      "main": {},
      "_keys": {}
    }
  }
]
<<===== INPUT =====<<
