>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "TQD9WQGJ"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
<var>year</var> Repub. Tex. Laws <var>page no.</var>
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
[
  {
    "id": "TQD9WQGJ",
    "position": 0
  }
]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "TQD9WQGJ",
    "type": "legislation",
    "title": "Repub. Tex. Laws",
    "volume": "2000",
    "section": "45",
    "jurisdiction": "us:tx"
  }
]
<<===== INPUT =====<<