>>===== MODE =====>>
citation
<<===== MODE =====<<

>>===== KEYS =====>>
[
  "YYRWVFQM"
]
<<===== KEYS =====<<

>>===== DESCRIPTION =====>>
Initial test checkin
<<===== DESCRIPTION =====<<

>>===== RESULT =====>>
<var>year</var> P.R. Leyes <var>page no.</var>
<<===== RESULT =====<<

>>===== CITATION-ITEMS =====>>
[
[
  {
    "id": "YYRWVFQM",
    "position": 0
  }
]
]
<<===== CITATION-ITEMS =====<<

>>===== INPUT =====>>
[
  {
    "id": "YYRWVFQM",
    "type": "legislation",
    "title": "P.R. Leyes",
    "volume": "2000",
    "section": "45",
    "jurisdiction": "us:pr"
  }
]
<<===== INPUT =====<<